### Forest Snapshot Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.daily_snapshot.data.external.sources_tar: Reading...
module.daily_snapshot.data.local_file.init: Reading...
module.daily_snapshot.data.local_file.init: Read complete after 0s [id=c77d1ebbb6f78dfc539ffb4421bfd67e307990e8]
module.daily_snapshot.data.external.sources_tar: Read complete after 0s [id=-]
module.daily_snapshot.data.local_file.sources: Reading...
module.daily_snapshot.data.local_file.sources: Read complete after 0s [id=a58fd8962de3a0aa38bc857efe31366e154486bf]
module.daily_snapshot.data.digitalocean_project.forest_project: Reading...
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Reading...
module.daily_snapshot.digitalocean_volume.forest_storage: Refreshing state... [id=9a1aa2c9-0b75-11ee-b0a7-0a58ac14d15f]
module.daily_snapshot.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.daily_snapshot.digitalocean_droplet.forest: Refreshing state... [id=360824553]
module.daily_snapshot.digitalocean_firewall.forest-firewall: Refreshing state... [id=64dd4d5d-e4af-4b9a-85f6-d92574fd2ef6]
module.daily_snapshot.digitalocean_volume_attachment.attach_forest_storage: Refreshing state... [id=360824553-9a1aa2c9-0b75-11ee-b0a7-0a58ac14d15f-20230615235525514800000001]
module.daily_snapshot.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.daily_snapshot.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.daily_snapshot.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = <<-EOT
            [forest-snapshot]
            68.183.219.180
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>